RU/Files/day_2_Ext/ShapeOptCases/run/optimisation/sphereBoxHex/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField  uniform (40 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (40 0 0);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (40 0 0);
    }
    box-1
    {
        type            symmetryPlane;
    }
    box-4
    {
        type            symmetryPlane;
    }
    box-5
    {
        type            symmetryPlane;
    }
    box-6
    {
        type            symmetryPlane;
    }
    sphere
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
