RU/Files/day_2_Ext/ShapeOptCases/run/optimisation/sphereBoxHex/system/rbfMotionDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          rbfMotionDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

movingPatches
(
    sphere
);

controlPoints
(
    // Moving points

    (-0.3  -0.3 -0.3)
    (-0.3   0.3 -0.3)
    (-0.3  -0.3  0.3)
    (-0.3   0.3  0.3)

    ( 0.3  -0.3 -0.3)
    ( 0.3   0.3 -0.3)
    ( 0.3  -0.3  0.3)
    ( 0.3   0.3  0.3)

    ( 0.7  0  0)

    // Box points

    // Back plane
    (-2  -2  -2)
    ( 2  -2  -2)

    (-2   2  -2)
    ( 2   2  -2)

    // Front plane
    (-2  -2   2)
    ( 2  -2   2)

    (-2   2   2)
    ( 2   2   2)
);


motionBounds
(
    // Moving points

    // Back plane

    ((0  0.1  0.1) (0 -0.1 -0.1))
    ((0 -0.1  0.1) (0  0.1 -0.1))
    ((0  0.1 -0.1) (0 -0.1  0.1))
    ((0 -0.1 -0.1) (0  0.1  0.1))

    ((0 -0.1 -0.1) (0  0.1  0.1))
    ((0  0.1 -0.1) (0 -0.1  0.1))
    ((0 -0.1  0.1) (0  0.1 -0.1))
    ((0  0.1  0.1) (0 -0.1 -0.1))

    (( -0.2 0 0) (0.5 0 0))

    // Box points

    // Back plane
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))

    // Front plane
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
);

nSteps 10;

interpolation
{
    RBF  IMQB;
    innerRadius 1.2;
    outerRadius 1.7;
    focalPoint  (0 0 0);

    polynomials false;

    W2Coeffs
    {
        radius        1.0;
    }
    TPSCoeffs
    {
        radius        5.0;
    }
    GaussCoeffs
    {
        radius        0.1;
    }
    IMQBCoeffs
    {
        radius        0.5;
    }
}




// ************************************************************************* //
